【攻防世界】Web 新手题：PHP2

我的解题过程：
1、初试尝试
看到映入眼帘的是一串英文，翻译后：你能验证这个网站吗？F2看了一下终端，ctrl+u查看了源代码，发现什么也没有。

2、学习与探索
通过查找，发现在这里居然需要用index.phps来查看源代码，我只知道index.php是首页，压根不懂phps是啥
什么是 .phps呢？ 
phps 文件就是php的源代码文件，通常用于提供给用户（访问者）查看php代码，因为用
户无法直接通过Web浏览器看到php文件的内容，所以需要用phps文件代替。其实，只
要不用php等已经在服务器中注册过的MIME类型为文件即可，但为用了phps文件类型。 
了国际通用，所以才用了phps文件类型。

3、拼接index.phps出现php源代码，接下来就是要代码审计了，看懂这是个什么样的，发现只有admin为url编码的时候才可以，但是呢，地址栏会将url编码自动解码
所以，我们可以进行两次编码。这样就可以了


总结：
构造payload ： http://111.198.29.45:48961/?id=%2561dmin 
%25 通过url栏变成%，%61通过urldecode变成a，配合成id=admin 
得到flag
